// LeetCode.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "Arr101.h"
#include "leet_code_75.h"

int main()
{
    
   /* vector<int> nums = { 1,1,0,1,1,1 };
    for (int i = 0; i < nums.size(); i++) {
        std::cout << nums[i] << ",";
    }
    std::cout << "\n\r";
    Arr101 arr = Arr101();
    std::cout << "Result: " << arr.findMaxConsecutiveOnes(nums);*/
    leet_code_75 s = leet_code_75();
    string a = "ab";
    string b = "pqrs";
    cout << s.mergeAlternately(a, b);

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
